app/controllers/welcome_controller.rb

	def nombre
		@name = params[:name]
		a = User.new
		a.name = @name
		a.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "sopa"], ["created_at", "2015-08-20 19:32:39.657816"], ["updated_at", "2015-08-20 19:32:39.657816"]]

	def recuperar
		@users = User.all
---
SELECT "users".* FROM "users"

	def actualizar
		@uname = params[:id]
		user = User.find_by(id: @uname)
		user.name = "#{user.name}(Actulizado)"
		user.save
		@users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Santiago(Actulizado)"], ["updated_at", "2015-08-23 21:18:42.293916"], ["id", 10]]
SELECT  "users".* FROM "users" WHERE (1=0) LIMIT 1